#include "EC.h"//  配置
#ifdef CONSOLE//
//=============




#include <iostream>
#include "DynamicSwitches.h"



//===================================================
//				此文件为单元测试入口			   //
//===================================================
int main() {

	//在主函数内部进行单元测试
	/*		注意

	使用单元测试通道时要修改 "EC.h"	
	配置文件中 宏定义为		#define	CONSOLE
	
	*/
/*//==========================================================================================================
*+			+			+ 		    +o		I	   o +			 +		   	 +			 +			 +		//
* +		  +	  +		  +	  +		  +	 o 	 	I	   o   +	   +   +	   +   +       +   +	   +   +	//
*	+	+		+	+ 		+	+	 o   \\ I //   o     +	 +	     +	 +		 +	 +		 +	 +		 +	//
*	  + 		  +			  +		 o	  \\_//	   o	   +		   +		   +		   +		   +//
//==========================================================================================================*/




    size_t numSwitches = 50; // 假设需要存储 50 个开关状态

    DynamicSwitches dynamicSwitches(numSwitches);

    // 设置第0位和第31位的开关状态为1
    dynamicSwitches.setSwitch(0, true);
    dynamicSwitches.setSwitch(31, true);

    // 获取并输出第0位和第31位的开关状态
    for (int i =0 ;i<40;i++){
	std::cout<<"第"<<i<<"位:"<<dynamicSwitches.getSwitch(i)<<std::endl;
	
	}
    // 清除所有开关状态
    dynamicSwitches.clearSwitches();

    // 输出开关总数
    std::cout << "开关总数为：" << dynamicSwitches.getNumSwitches() << std::endl;
	
/*//==========================================================================================================
*+			+			+ 		    +o	  //-\\	     o +		   +	        +		    +		    +	   //
* +		  +	  +		  +	  +		  +	 o 	 //	I \\     o   +	     +   +	      +   +	      +   +	      +	  +	   //
*	+	+		+	+ 		+	+	 o      I 	     o     +   +       +   +		+	+		+   +		+  //
*	  + 		  +			  +		 o	  	I	     o       +		   	 +			  +		      +			 + //
//==========================================================================================================*/
	system("pause"); 
    return 0;
}
#endif